#3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

# 1)Через list
a = [12, 1, 2]
b = [3, 4, 5]
c = [6, 7, 8]
d = [9, 10, 11]

answer = input("Введите номер месяца от 1 до 12")
if int(answer) in a:
   print("Зима")
elif int(answer) in b:
   print("Весна")
elif int(answer) in c:
  print("Лето")
else:
    print("Осень")

# 2) через dict
seasons = {12:"Зима",
            1:"Зима",
            2:"Зима",
            3:"Весна",
            4:"Весна",
            5:"Весна",
            6:"Лето",
           7:"Лето",
           8:"Лето",
           9:"Осень",
           10:"Осень",
           11:"Осень",
           }
print(seasons)
print(seasons.get(int(input("Введите число месяца от 1 до 12"))))